RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sf_cfg.c
    .ioMode = (SF_CTRL_QIO_MODE | 0x20),
    .clkDelay = 1,
    .clkInvert = 0x3f,

    .resetEnCmd = 0x66,
    .resetCmd = 0x99,
    .cRExit = 0xff,
    .wrEnableWriteRegLen = 0x00,

    /*id*/
    .jedecIdCmd = 0x9f,
    .jedecIdCmdDmyClk = 0,
    .enter32BitsAddrCmd = 0xb7,
    .exit32BitsAddrCmd = 0xe9,
    .sectorSize = 4,
    .pageSize = 256,

    /*read*/
    .fastReadCmd = 0x0b,
    .frDmyClk = 8 / 8,
    .qpiFastReadCmd = 0x0b,
    .qpiFrDmyClk = 8 / 8,
    .fastReadDoCmd = 0x3b,
    .frDoDmyClk = 8 / 8,
    .fastReadDioCmd = 0xbb,
    .frDioDmyClk = 0,
    .fastReadQoCmd = 0x6b,
    .frQoDmyClk = 8 / 8,

    .qpiFastReadQioCmd = 0xeb,
    .qpiFrQioDmyClk = 16 / 8,
    .qpiPageProgramCmd = 0x02,
    .writeVregEnableCmd = 0x50,

    /* qpi mode */
    .enterQpi = 0x38,
    .exitQpi = 0xff,

    /*AC*/
    .timeEsector = 400,
    .timeE32k = 1000,
    .timeE64k = 2000,
    .timePagePgm = 5,
    .timeCe = 33 * 1000,
    .pdDelay = 20,
    .qeData = 0,
};

static const ATTR_TCM_CONST_SECTION Flash_Info_t flashInfos[] = {
    {
        .jedecID = 0x1440ef,
        //.name="Winb_80DV_08_33",
        .cfg = &flashCfg_Winb_80DV,
    },
    {
        .jedecID = 0x1540ef,
        //.name="Winb_16JV_16_33",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1640ef,
        //.name="Winb_32FV_32_33",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1840ef,
        //.name="Winb_128JV_128_33",
        .cfg = &flashCfg_Winb_64JW,
    },
    {
        .jedecID = 0x1940ef,
        //.name="Winb_256FV_128_33",
        .cfg = &flashCfg_Winb_256FV,
    },
    {
        .jedecID = 0x1460ef,
        //.name="Winb_80EW_08_18",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1560ef,
        //.name="Winb_16FW_16_18",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1660ef,
        //.name="Winb_32FW_32_18",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1760ef,
        //.name="WB_64JW_64_18",
        .cfg = &flashCfg_Winb_64JW,
    },
    {
        .jedecID = 0x1860ef,
        //.name="Winb_128JW_128_18",
        .cfg = &flashCfg_Winb_64JW,
    },
    {
        .jedecID = 0x1570ef,
        //.name="Winb_16JV_16_33",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1870ef,
        //.name="Winb_128JV_128_33",
        .cfg = &flashCfg_Winb_64JW,
    },
    {
        .jedecID = 0x1680ef,
        //.name="Winb_32JW_32_18",
        .cfg = &flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x1880ef,
        //.name="Winb_128JW_128_18",
        .cfg = &flashCfg_Winb_64JW,
    },
    {
        .jedecID = 0x1440C8,
        //.name="GD_Q08E_08_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1540C8,
        //.name="GD_Q16E_16_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1640C8,
        //.name="GD_Q32C_32_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x1740C8,
        //.name="GD_Q64E_64_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x1840C8,
        //.name="GD_Q128E_128_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x1460C8,
        //.name="GD_LQ08C_08_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1560C8,
        //.name="GD_LE16C_16_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1660C8,
        //.name="GD_LQ32D_32_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1760c8,
        //.name="GD_LQ64E_64_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1860c8,
        //.name="GD_LQ128E_64_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x1465C8,
        //.name="GD_WQ80E_80_33",
        .cfg = &flashCfg_Gd_WQ80E_WQ16E,
    },
    {
        .jedecID = 0x1565C8,
        //.name="GD_WQ16E_16_33",
        .cfg = &flashCfg_Gd_WQ80E_WQ16E,
    },
    {
        .jedecID = 0x1665C8,
        //.name="GD_WQ32E_32_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x15345e,
        //.name="ZB_WQ16A_16_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x15405e,
        //.name="ZB_Q16B_16_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x16405e,
        //.name="ZB_Q32B_32_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x17405e,
        //.name="ZB_Q64B_64_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x14605E,
        //.name="ZB_VQ80",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x15605E,
        //.name="ZB_VQ16",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x1820C2,
        //.name="MX_25L128_128_33",
        .cfg = &flashCfg_Mxic_128,
    },
    {
        .jedecID = 0x1920C2,
        //.name="MX_25L256_256_33",
        .cfg = &flashCfg_Mxic_25L256,
    },
    {
        .jedecID = 0x3925C2,
        //.name="MX_25U256_256_33",
        .cfg = &flashCfg_Mxic_25L256,
    },
    {
        .jedecID=0x144020,
        //.name="XM_25QH80_80_33",
        .cfg=&flashCfg_Winb_16JV,
    },
    {
        .jedecID=0x154020,
        //.name="XM_25QH16_16_33",
        .cfg=&flashCfg_Winb_16JV,
    },
    {
        .jedecID=0x164020,
        //.name="XM_25QH32_32_33",
        .cfg=&flashCfg_Winb_16JV,
    },
    {
        .jedecID=0x174020,
        //.name="XM_25QH64_64_33",
        .cfg=&flashCfg_Winb_16JV,
    },
    {
        .jedecID = 0x15400B,
        //.name="XT_25F16B_16_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x16400B,
        //.name="XT_25F32B_32_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x17400B,
        //.name="XT_25F64B_32_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x18400B,
        //.name="XT_25F128B_128_33",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x14600B,
        //.name="XT_25Q80B_08_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x16600B,
        //.name="XT_25Q32B_32_18",
        .cfg = &flashCfg_Gd_Q80E_Q16E,
    },
    {
        .jedecID = 0x144068,
        //.name="Boya_Q08B_08_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x154068,
        //.name="Boya_Q16B_16_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x164068,
        //.name="Boya_Q32B_32_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x174068,
        //.name="Boya_Q64A_64_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    },
    {
        .jedecID = 0x184068,
        //.name="Boya_Q128A_128_33",
        .cfg = &flashCfg_Gd_Q32E_Q128E,
    }
};
#endif

/*@} end of group SF_CFG_Private_Variables */

/** @defgroup  SF_CFG_Global_Variables
 *  @{
 */

/*@} end of group SF_CFG_Global_Variables */

