RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sf_cfg.c
/** @defgroup  SF_CFG_Private_Fun_Declaration
 *  @{
 */

/*@} end of group SF_CFG_Private_Fun_Declaration */

/** @defgroup  SF_CFG_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Init external flash GPIO according to flash GPIO config
 *
 * @param  extFlashPin: Flash GPIO config
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Init_Ext_Flash_Gpio(uint8_t extFlashPin)
{
    GLB_GPIO_Cfg_Type cfg;
    uint8_t gpiopins[6];
    uint8_t i = 0;

    cfg.gpioMode = GPIO_MODE_AF;
    cfg.pullType = GPIO_PULL_UP;
    cfg.drive = 2;
    cfg.smtCtrl = 1;
    cfg.gpioFun = GPIO_FUN_FLASH;

    if (extFlashPin == 0) {
        gpiopins[0] = BFLB_EXTFLASH_CLK0_GPIO;
        gpiopins[1] = BFLB_EXTFLASH_CS0_GPIO;
        gpiopins[2] = BFLB_EXTFLASH_DATA00_GPIO;
        gpiopins[3] = BFLB_EXTFLASH_DATA10_GPIO;
        gpiopins[4] = BFLB_EXTFLASH_DATA20_GPIO;
        gpiopins[5] = BFLB_EXTFLASH_DATA30_GPIO;
    } else {
        return ERROR;
    }

    for (i = 0; i < sizeof(gpiopins); i++) {
        cfg.gpioPin = gpiopins[i];

        if (i == 0 || i == 1) {
            /* flash clk and cs is output */
            cfg.gpioMode = GPIO_MODE_OUTPUT;
        } else {
            /* data are bidir */
            cfg.gpioMode = GPIO_MODE_AF;
        }

        GLB_GPIO_Init(&cfg);
    }

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Deinit external flash GPIO according to flash GPIO config
 *
 * @param  extFlashPin: Flash GPIO config
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Deinit_Ext_Flash_Gpio(uint8_t extFlashPin)
{
    GLB_GPIO_Cfg_Type cfg;
    uint8_t gpiopins[6];
    uint8_t i = 0;

    cfg.gpioMode = GPIO_MODE_INPUT;
    cfg.pullType = GPIO_PULL_UP;
    cfg.drive = 1;
    cfg.smtCtrl = 1;
    cfg.gpioFun = GPIO_FUN_GPIO;

    if (extFlashPin == 0) {
        gpiopins[0] = BFLB_EXTFLASH_CLK0_GPIO;
        gpiopins[1] = BFLB_EXTFLASH_CS0_GPIO;
        gpiopins[2] = BFLB_EXTFLASH_DATA00_GPIO;
        gpiopins[3] = BFLB_EXTFLASH_DATA10_GPIO;
        gpiopins[4] = BFLB_EXTFLASH_DATA20_GPIO;
        gpiopins[5] = BFLB_EXTFLASH_DATA30_GPIO;
    } else {
        return ERROR;
    }

    for (i = 0; i < sizeof(gpiopins); i++) {
        cfg.gpioPin = gpiopins[i];
        GLB_GPIO_Init(&cfg);
    }

    return SUCCESS;
}
#endif

/*@} end of group SF_CFG_Private_Functions */

/** @defgroup  SF_CFG_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Get flash config according to flash ID
 *
 * @param  flashID: Flash ID
 * @param  pFlashCfg: Flash config pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Get_Flash_Cfg_Need_Lock(uint32_t flashID, SPI_Flash_Cfg_Type *pFlashCfg,
                                                            uint8_t group, SF_Ctrl_Bank_Select bank)
{
    uint32_t i;
    uint8_t buf[sizeof(SPI_Flash_Cfg_Type) + 8];
    uint32_t crc, *pCrc;
    uint32_t xipOffset;

    if (flashID == 0) {
        xipOffset = SF_Ctrl_Get_Flash_Image_Offset(group, bank);
        SF_Ctrl_Set_Flash_Image_Offset(0, group, bank);
        XIP_SFlash_Read_Via_Cache_Need_Lock(8 + BL808_FLASH_XIP_BASE, buf, sizeof(SPI_Flash_Cfg_Type) + 8, group, bank);
        SF_Ctrl_Set_Flash_Image_Offset(xipOffset, group, bank);

        if (ARCH_MemCmp(buf, BFLB_FLASH_CFG_MAGIC, 4) == 0) {
            crc = BFLB_Soft_CRC32((uint8_t *)buf + 4, sizeof(SPI_Flash_Cfg_Type));
            pCrc = (uint32_t *)(buf + 4 + sizeof(SPI_Flash_Cfg_Type));

            if (*pCrc == crc) {
                ARCH_MemCpy_Fast(pFlashCfg, (uint8_t *)buf + 4, sizeof(SPI_Flash_Cfg_Type));
                return SUCCESS;
            }
        }
    } else {
        for (i = 0; i < sizeof(flashInfos) / sizeof(flashInfos[0]); i++) {
            if (flashInfos[i].jedecID == flashID) {
                ARCH_MemCpy_Fast(pFlashCfg, flashInfos[i].cfg, sizeof(SPI_Flash_Cfg_Type));
                return SUCCESS;
            }
        }
    }

    return ERROR;
}
#endif

/****************************************************************************/ /**
 * @brief  Get flash config according to flash ID patch
 *
 * @param  flashID: Flash ID
 * @param  pFlashCfg: Flash config pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Get_Flash_Cfg_Need_Lock_Ext(uint32_t flashID, SPI_Flash_Cfg_Type *pFlashCfg,
                                                                uint8_t group, SF_Ctrl_Bank_Select bank)
{
    return SF_Cfg_Get_Flash_Cfg_Need_Lock(flashID, pFlashCfg, group, bank);
}
#endif

/****************************************************************************/ /**
 * @brief  Init flash GPIO according to flash Pin config
 *
 * @param  flashPinCfg: Specify flash Pin config
 * @param  restoreDefault: Wether to restore default setting
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Init_Flash_Gpio(SF_Ctrl_Pin_Select flashPinCfg, uint8_t restoreDefault)
{
    uint8_t selEmbedded = 0;
    uint8_t swap = 0;

    if ((flashPinCfg&(1<<3)) > 0) {
        return ERROR;
    }

    if (restoreDefault) {
        /* Set Default first */
        GLB_Set_Flash_IO_PARM(1, 1);
        SF_Ctrl_Select_Pad(SF_IO_EMB_SWAP_IO0_IO3);

        /* Default is set, so return */
        if (flashPinCfg == SF_IO_EMB_SWAP_IO0_IO3) {
            return SUCCESS;
        }
    }

    if (flashPinCfg & (1 << 2)) {
        /* Init sf2 gpio */
        SF_Cfg_Init_Ext_Flash_Gpio(0);
        selEmbedded = 0;
    } else {
        selEmbedded = 1;
    }
    /* if pin select dual flash, embedded is default */
    if ((flashPinCfg & (1 << 4))) {
        selEmbedded = 1;
    }

