RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sf_cfg.c
    swap = ((flashPinCfg >> 1) & 1);
    swap = (!swap);
    GLB_Set_Flash_IO_PARM(selEmbedded, swap);
    SF_Ctrl_Select_Pad(flashPinCfg);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Identify one flash
 *
 * @param  callFromFlash: code run at flash or ram
 * @param  flashPinCfg: Bit 7: autoscan, Bit6-0: flash GPIO config
 * @param  restoreDefault: Wether restore default flash GPIO config
 * @param  pFlashCfg: Flash config pointer
 * @param  group: CPU group id 0 or 1
 * @param  bank: Flash bank select
 *
 * @return Flash ID
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint32_t ATTR_TCM_SECTION SF_Cfg_Flash_Identify(uint8_t callFromFlash, uint8_t flashPinCfg,
                                                uint8_t restoreDefault, SPI_Flash_Cfg_Type *pFlashCfg, uint8_t group, SF_Ctrl_Bank_Select bank)
{
    uint8_t autoScan = 0;
    uint8_t flashPin = 0;
    uint32_t jdecId = 0;
    uint32_t i = 0;
    uint32_t offset;
    BL_Err_Type stat;

    autoScan = ((flashPinCfg >> 7) & 1);
    flashPin = (flashPinCfg & 0x7F);

    ARCH_MemCpy_Fast(pFlashCfg, &flashCfg_Winb_16JV, sizeof(SPI_Flash_Cfg_Type));

    if (callFromFlash == 1) {
        stat = XIP_SFlash_State_Save(pFlashCfg, &offset, group, bank);

        if (stat != SUCCESS) {
            SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);
            return 0;
        }
    }

    if (autoScan) {
        flashPin = 0;

        do {
            if (flashPin > SF_IO_EMB_SWAP_NONE_DUAL_IO0_AND_EXT_SF2) {
                jdecId = 0;
                break;
            }

            if (!IS_SF_CTRL_PIN_SELECT(flashPin) || (flashPin&(1<<3)) > 0) {
                flashPin++;
                continue;
            }

            SF_Cfg_Init_Flash_Gpio(flashPin, restoreDefault);
            SFlash_Release_Powerdown(pFlashCfg);
            SFlash_Reset_Continue_Read(pFlashCfg);
            SFlash_DisableBurstWrap(pFlashCfg);
            jdecId = 0;
            SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
            SFlash_DisableBurstWrap(pFlashCfg);
            jdecId = jdecId & 0xffffff;
            flashPin++;
        } while ((jdecId & 0x00ffff) == 0 || (jdecId & 0xffff00) == 0 || (jdecId & 0x00ffff) == 0xffff || (jdecId & 0xffff00) == 0xffff00);
    } else {
        /* select media gpio */
        SF_Cfg_Init_Flash_Gpio(flashPin, restoreDefault);
        SFlash_Release_Powerdown(pFlashCfg);
        SFlash_Reset_Continue_Read(pFlashCfg);
        SFlash_DisableBurstWrap(pFlashCfg);
        SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
        SFlash_DisableBurstWrap(pFlashCfg);
        jdecId = jdecId & 0xffffff;
    }

    for (i = 0; i < sizeof(flashInfos) / sizeof(flashInfos[0]); i++) {
        if (flashInfos[i].jedecID == jdecId) {
            ARCH_MemCpy_Fast(pFlashCfg, flashInfos[i].cfg, sizeof(SPI_Flash_Cfg_Type));
            break;
        }
    }

    if (i == sizeof(flashInfos) / sizeof(flashInfos[0])) {
        if (callFromFlash == 1) {
            XIP_SFlash_State_Restore(pFlashCfg, offset, group, bank);
        }

        return jdecId;
    } else {
        if (callFromFlash == 1) {
            XIP_SFlash_State_Restore(pFlashCfg, offset, group, bank);
        }

        return (jdecId | BFLB_FLASH_ID_VALID_FLAG);
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Identify one flash patch
 *
 * @param  callFromFlash: code run at flash or ram
 * @param  flashPinCfg: Bit 7: autoscan, Bit6-0: flash GPIO config
 * @param  restoreDefault: Wether restore default flash GPIO config
 * @param  pFlashCfg: Flash config pointer
 * @param  group: CPU group id 0 or 1
 * @param  bank: Flash bank select
 *
 * @return Flash ID
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
uint32_t ATTR_TCM_SECTION SF_Cfg_Flash_Identify_Ext(uint8_t callFromFlash, uint8_t flashPinCfg,
    uint8_t restoreDefault, SPI_Flash_Cfg_Type *pFlashCfg, uint8_t group, SF_Ctrl_Bank_Select bank)
{
    return SF_Cfg_Flash_Identify(callFromFlash, flashPinCfg, restoreDefault, pFlashCfg, group, bank);
}
#endif

/****************************************************************************/ /**
 * @brief  SF Cfg flash init
 *
 * @param  sel: SF pin select
 * @param  pSfCtrlCfg: Serial flash controller configuration pointer
 * @param  pBank2Cfg: Serial flash2 controller configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Flash_Init(SF_Ctrl_Pin_Select sel, const SF_Ctrl_Cfg_Type *pSfCtrlCfg, const SF_Ctrl_Bank2_Cfg *pBank2Cfg)
{
    uint8_t selEmbedded = 0;
    uint8_t swap = 0;

    if ((sel&(1<<3)) > 0) {
        return ERROR;
    }

    if (sel & (1 << 2)) {
        SF_Cfg_Init_Ext_Flash_Gpio(0);
        selEmbedded = 0;
    } else {
        selEmbedded = 1;
    }
    /* If pin select dual flash, embedded is default */
    if ((sel & (1 << 4))) {
        selEmbedded = 1;
    }

    swap = ((sel >> 1) & 1);
    swap = (!swap);
    GLB_Set_Flash_IO_PARM(selEmbedded, swap);
    SF_Ctrl_Select_Pad(sel);

    if (sel <= SF_IO_EMB_SWAP_NONE_DUAL_IO0) {
        /* Embedded pad1 io delay set */
        SF_Ctrl_Set_IO_Delay(SF_CTRL_PAD1, pSfCtrlCfg->doDelay, pSfCtrlCfg->diDelay, pSfCtrlCfg->oeDelay);
    } else if (sel <= SF_IO_EXT_SF2) {
        /* Pad2 or pad3 io delay set */
        SF_Ctrl_Set_IO_Delay((sel >> 2), pSfCtrlCfg->doDelay, pSfCtrlCfg->diDelay, pSfCtrlCfg->oeDelay);
    } else if (sel >= SF_IO_EMB_SWAP_IO0_IO3_AND_EXT_SF2 && sel <= SF_IO_EMB_SWAP_NONE_DUAL_IO0_AND_EXT_SF2) {
        /* Dual flash mode, embedded pad1 and pad2 io delay set */
        SF_Ctrl_Set_IO_Delay(SF_CTRL_PAD1, pSfCtrlCfg->doDelay, pSfCtrlCfg->diDelay, pSfCtrlCfg->oeDelay);
        SF_Ctrl_Set_IO_Delay(SF_CTRL_PAD2, pBank2Cfg->doDelay, pBank2Cfg->diDelay, pBank2Cfg->oeDelay);
    }

    if (pBank2Cfg != NULL) {
        if (pBank2Cfg->sbus2Select) {
            if (sel >= SF_IO_EMB_SWAP_IO0_IO3_AND_EXT_SF2 && sel <= SF_IO_EMB_SWAP_NONE_DUAL_IO0_AND_EXT_SF2) {
                /* Default sbus2 replace opt flash2 */
                SF_Ctrl_Sbus2_Replace(SF_CTRL_PAD2);
            }
        }
    }

    SFlash_Init(pSfCtrlCfg, pBank2Cfg);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  SF Cfg system bus 2 flash init
 *
 * @param  sel: SF pin select
 * @param  pBank2Cfg: Serial flash2 controller configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Sbus2_Flash_Init(SF_Ctrl_Pin_Select sel, const SF_Ctrl_Bank2_Cfg *pBank2Cfg)
{
    if (sel < SF_IO_EMB_SWAP_IO0_IO3_AND_EXT_SF2 || sel > SF_IO_EMB_SWAP_NONE_DUAL_IO0_AND_EXT_SF2) {
        return ERROR;
    }

    /* Init flash2 gpio */
    if (sel & (1 << 2)) {
        SF_Cfg_Init_Ext_Flash_Gpio(0);
    }

    /* Set remap for flash2 xip mode */
    SF_Ctrl_Remap_Set(pBank2Cfg->remap, pBank2Cfg->remapLock);

    /* Dual flash mode, pad2 io delay set */
    SF_Ctrl_Set_IO_Delay(SF_CTRL_PAD2, pBank2Cfg->doDelay, pBank2Cfg->diDelay, pBank2Cfg->oeDelay);

    if (pBank2Cfg->sbus2Select) {
        /* Default sbus2 replace opt flash2 */
        SF_Ctrl_Sbus2_Replace(SF_CTRL_PAD2);
    }

    SFlash_Init(NULL, pBank2Cfg);

    return SUCCESS;
}
#endif

/*@} end of group SF_CFG_Public_Functions */

/*@} end of group SF_CFG */

/*@} end of group BL808_Peripheral_Driver */
